/*
logic operation
    العمليات (البوبات) المنطقية
                       جدول الحقيقة في البرمجة
                                AndGATE
   ------------------------------             -----------------
  |    A     |    B     |   AB   |           |  A  |  B  |  AB |
   ------------------------------             -----------------
  |  false   |  false   | false  |           |  0  |  0  |  0  |
  -------------------------------             -----------------
  |  false   |  true    | false  |           |  0  |  1  |  0  |
  -------------------------------             -----------------
  |  true    |  false   | false  |           |  1  |  0  |  0  |
  -------------------------------             -----------------
  |  true    |  true    | true   |           |  1  |  1  |  1  |
  -------------------------------            -------------------
===================================================================
                                ORGATE
   ------------------------------             -----------------
  |    A     |    B     |   AB   |           |  A  |  B  |  AB |
   ------------------------------             -----------------
  |  false   |  false   | false  |           |  0  |  0  |  0  |
  -------------------------------             -----------------
  |  false   |  true    | true   |           |  0  |  1  |  1  |
  -------------------------------             -----------------
  |  true    |  false   | true   |           |  1  |  0  |  1  |
  -------------------------------             -----------------
  |  true    |  true    | true   |           |  1  |  1  |  1  |
  -------------------------------            -------------------
===================================================================
                                  NOTGATE
                                النفي
         --------------                   ------------
        |  A  |  A     |                 |  A  |  A   |
         --------------                   ------------
        | false | true |                 |  0  |  1   |
         --------------                   ------------
        | true  | false|                 |  1  |  0   |
         --------------                   ------------

 */



/*
مثال اولي  عندما نتعامل مع البولين (Boolean)
 فان قيمة المتغير تبقى محصورة بين الكلمتين (true)(false)

fun com.munir.packag.main(args: Array<String>) {
    var isMarried:Boolean=false
    print(isMarried)
}
 */

fun main(args: Array<String>) {
    println("EX1 FOR AND")
    println(3>=2)
    println(3<2)
    println(3>2)
    println(3<=2)
    //هنا عند المساوات يكتب (==)
    println(3==2)
    // هناعندما نكتب (=!) تعني لا تساوي
    println(3!=2)
    println("-------------------")

    /*

      في هذا المثال نقوم بتطبيق عمل جدول الحقيقة   ANDGATE
    بوضع العلامة (&&)  وبما انه قمنا بمقارنة الامثلة سابقا وكانت نيجتهما FALSE وحسب بوابة AND فأن النتيجة حتما سوف تكون FALSE

      */

     // هذا المثال يمثل الحالات الاربعة ل جدول الحقبقة ANDGATE
    println("EX2")
    println(3>10 &&  10>2)
    println(3>10 &&  10<2)
    println(3<10 &&  10<2)
    println(3<10 &&  10>2)

    println("-------------------")



//مثال اخر

    println("EX3")
    var n1=10
    println(n1>=1 && n1<=100)
    var n=101
    println(n>=1 && n<=100)
    println("=====================")

    /*
          في هذا المثال نقوم بتطبيق عمل جدول الحقيقة   ORGATE
    بوضع العلامة (||)  بالتاي فان عمل ORGATE هي عكس عمل ANDGATE تماما نلاحظ الامثلة التالية

     */


    // هذا المثال يمثل الحلات الاربعة ل جدول الحقبقة ORGATE
    println("EX4  FOR OR")
    println(3>10 || 5<2 )
    println(3>10 || 5>2 )
    println(3<10 || 5<2 )
    println(3<10 || 5>2 )

    println("-----------------------")


    // مثال اخر لعملية or
    println("EX5")
    var n3=5
    println(n3<2 || n3<10)
    println("-----------------------")


    /*
    مثال اخر عن النفي  NOTGATE وتتعمل الرمز  (!) للنفي او قلب النتجية كما في الامثلة

     */
    // مثال على لجدول الحقيقة حالة النفي (!)
    println("EX6 NOTGEAT")
    var isMarried=false
    println(isMarried)
    var isMarried1=false
    println(!isMarried1)

    var isMarried2=true
    println(isMarried2)
    var isMarried3=true
    println(!isMarried3)


    println("-----------------------")

    //مثال اخر لدمج جميع  البوبات المنطقية
    println("EX7 FOR ALL EXAM")
    var n4=10
    println((n4>=1 && n4<=10) || (n4>=50 && n4<=70))

    //مثال اخر
    var n5=15
    println((n5>=1 && n5<=10) || (n5>=50 && n5<=70))

    //مثال اخر
    var n6=55
    println((n6>=1 && n6<=10) || (n6>=50 && n6<=70))
}


